## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/94b4aced-0a62-4e34-9ff3-f8c2323e7255/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app_environment_dapr_component.pubsub will be updated in-place
  ~ resource "azurerm_container_app_environment_dapr_component" "pubsub" {
        id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sb-pubsub"
        name                         = "sb-pubsub"
        # (6 unchanged attributes hidden)

      + metadata {
          + name  = "namespaceName"
          + value = "https://sb-biotrackr-prod-ae.servicebus.windows.net:443/"
        }

        # (1 unchanged block hidden)
    }

  # module.cosmosdb.azurerm_cosmosdb_account.acc will be created
  + resource "azurerm_cosmosdb_account" "acc" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = false
      + burst_capacity_enabled                       = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = true
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "australiaeast"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = "cosmos-biotrackr-prod-ae"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "rg-biotrackr-prod-ae"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities (known after apply)

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "australiaeast"
          + zone_redundant    = false
        }
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_container.container will be created
  + resource "azurerm_cosmosdb_sql_container" "container" {
      + account_name          = "cosmos-biotrackr-prod-ae"
      + database_name         = "biotrackr"
      + id                    = (known after apply)
      + name                  = "fitbitrecords"
      + partition_key_kind    = "Hash"
      + partition_key_path    = (known after apply)
      + partition_key_paths   = [
          + "/documentType",
        ]
      + partition_key_version = 1
      + resource_group_name   = "rg-biotrackr-prod-ae"
      + throughput            = 1000

      + conflict_resolution_policy (known after apply)

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_database.db will be created
  + resource "azurerm_cosmosdb_sql_database" "db" {
      + account_name        = "cosmos-biotrackr-prod-ae"
      + id                  = (known after apply)
      + name                = "biotrackr"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + throughput          = 1000
    }

Plan: 3 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_app_environment_dapr_component.pubsub will be updated in-place%0A  ~ resource "azurerm_container_app_environment_dapr_component" "pubsub" {%0A        id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sb-pubsub"%0A        name                         = "sb-pubsub"%0A        # (6 unchanged attributes hidden)%0A%0A      + metadata {%0A          + name  = "namespaceName"%0A          + value = "https://sb-biotrackr-prod-ae.servicebus.windows.net:443/"%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.cosmosdb.azurerm_cosmosdb_account.acc will be created%0A  + resource "azurerm_cosmosdb_account" "acc" {%0A      + access_key_metadata_writes_enabled           = true%0A      + analytical_storage_enabled                   = false%0A      + automatic_failover_enabled                   = false%0A      + burst_capacity_enabled                       = false%0A      + connection_strings                           = (sensitive value)%0A      + create_mode                                  = (known after apply)%0A      + default_identity_type                        = "FirstPartyIdentity"%0A      + enable_automatic_failover                    = (known after apply)%0A      + enable_free_tier                             = (known after apply)%0A      + enable_multiple_write_locations              = (known after apply)%0A      + endpoint                                     = (known after apply)%0A      + free_tier_enabled                            = true%0A      + id                                           = (known after apply)%0A      + is_virtual_network_filter_enabled            = false%0A      + kind                                         = "GlobalDocumentDB"%0A      + local_authentication_disabled                = false%0A      + location                                     = "australiaeast"%0A      + minimal_tls_version                          = (known after apply)%0A      + mongo_server_version                         = (known after apply)%0A      + multiple_write_locations_enabled             = (known after apply)%0A      + name                                         = "cosmos-biotrackr-prod-ae"%0A      + network_acl_bypass_for_azure_services        = false%0A      + offer_type                                   = "Standard"%0A      + partition_merge_enabled                      = false%0A      + primary_key                                  = (sensitive value)%0A      + primary_mongodb_connection_string            = (sensitive value)%0A      + primary_readonly_key                         = (sensitive value)%0A      + primary_readonly_mongodb_connection_string   = (sensitive value)%0A      + primary_readonly_sql_connection_string       = (sensitive value)%0A      + primary_sql_connection_string                = (sensitive value)%0A      + public_network_access_enabled                = true%0A      + read_endpoints                               = (known after apply)%0A      + resource_group_name                          = "rg-biotrackr-prod-ae"%0A      + secondary_key                                = (sensitive value)%0A      + secondary_mongodb_connection_string          = (sensitive value)%0A      + secondary_readonly_key                       = (sensitive value)%0A      + secondary_readonly_mongodb_connection_string = (sensitive value)%0A      + secondary_readonly_sql_connection_string     = (sensitive value)%0A      + secondary_sql_connection_string              = (sensitive value)%0A      + tags                                         = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + write_endpoints                              = (known after apply)%0A%0A      + analytical_storage (known after apply)%0A%0A      + backup (known after apply)%0A%0A      + capabilities (known after apply)%0A%0A      + capacity (known after apply)%0A%0A      + consistency_policy {%0A          + consistency_level = "Session"%0A        }%0A%0A      + geo_location {%0A          + failover_priority = 0%0A          + id                = (known after apply)%0A          + location          = "australiaeast"%0A          + zone_redundant    = false%0A        }%0A    }%0A%0A  # module.cosmosdb.azurerm_cosmosdb_sql_container.container will be created%0A  + resource "azurerm_cosmosdb_sql_container" "container" {%0A      + account_name          = "cosmos-biotrackr-prod-ae"%0A      + database_name         = "biotrackr"%0A      + id                    = (known after apply)%0A      + name                  = "fitbitrecords"%0A      + partition_key_kind    = "Hash"%0A      + partition_key_path    = (known after apply)%0A      + partition_key_paths   = [%0A          + "/documentType",%0A        ]%0A      + partition_key_version = 1%0A      + resource_group_name   = "rg-biotrackr-prod-ae"%0A      + throughput            = 1000%0A%0A      + conflict_resolution_policy (known after apply)%0A%0A      + indexing_policy {%0A          + indexing_mode = "consistent"%0A%0A          + included_path {%0A              + path = "/*"%0A            }%0A        }%0A    }%0A%0A  # module.cosmosdb.azurerm_cosmosdb_sql_database.db will be created%0A  + resource "azurerm_cosmosdb_sql_database" "db" {%0A      + account_name        = "cosmos-biotrackr-prod-ae"%0A      + id                  = (known after apply)%0A      + name                = "biotrackr"%0A      + resource_group_name = "rg-biotrackr-prod-ae"%0A      + throughput          = 1000%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>